In [3]:
ls_1=[3,5,7,9]
tuple_1=(1,2,3,4,5)
dict_1={"name" : "Mirai", "age": 23, "city": "Hyderabad", "State":"Telanaga"}

print(ls_1)
print(tuple_1)
print(dict_1)

[3, 5, 7, 9]
(1, 2, 3, 4, 5)
{'name': 'Mirai', 'age': 23, 'city': 'Hyderabad', 'State': 'Telanaga'}

In [2]:
import pandas as pd

data = {
    "name": ["Ram", "Seetha", "Hanuman", "Laxman"],
    "location": ["Jammu", "Hyderabad", "Bengaluru", "Vizag"],
    "age": [24, 22, 30, 21]
}

df = pd.DataFrame(data)

df.to_csv("data.csv", index=False)

print(pd.read_csv("data.csv"))

      name   location  age
0      Ram      Jammu   24
1   Seetha  Hyderabad   22
2  Hanuman  Bengaluru   30
3   Laxman      Vizag   21